tap "felixkratz/formulae"
tap "homebrew/services"
tap "nikitabobko/tap"
tap "shopify/shopify"
# TIFF library and utilities
brew "libtiff"
# New file format for still image compression
brew "jpeg-xl"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Core application library for C
brew "glib"
# Cross-platform make
brew "cmake"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Simple, fast and user-friendly alternative to find
brew "fd"
# OpenType text shaping engine
brew "harfbuzz"
# Image processing and image analysis library
brew "leptonica"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Real-time software synthesizer based on the SoundFont 2 specs
brew "fluid-synth"
# Command-line tools for fly.io services
brew "flyctl"
# Command-line fuzzy finder written in Go
brew "fzf"
# Quickly rewrite git repository history
brew "git-filter-repo"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Retrieves currently playing media, and simulates media actions
brew "nowplaying-cli"
# General-purpose scripting language
brew "php"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# SVG rendering tool and library
brew "resvg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Rust toolchain installer
brew "rustup"
# Library for loading images as SDL surfaces and textures
brew "sdl2_image"
# Sample multi-channel audio mixer library
brew "sdl2_mixer"
# Library for using TrueType fonts in SDL applications
brew "sdl2_ttf"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Terminal-based client for Spotify
brew "spotify-tui"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
brew "shopify/shopify/theme-check"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"

cask "font-hack-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-symbols-only-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# 2D game framework for Lua
cask "love"
# Control your tools with a few keystrokes
cask "raycast"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# System monitor for the menu bar
cask "stats"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "github.vscode-github-actions"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "laravel.vscode-laravel"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "shopify.polaris-for-vscode"
vscode "shopify.theme-check-vscode"
vscode "shopify.vscode-shopify-dev-assistant"
vscode "solomonkinard.git-blame"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "waderyan.gitblame"
